---
kind: method
id: M:Autodesk.Revit.DB.ImportOptions3DM.#ctor
source: html/bbb77624-2106-15c9-e53c-a02ca981e576.htm
---
# Autodesk.Revit.DB.ImportOptions3DM.#ctor Method

Constructs a new instance of ImportOptions3DM with default values of all properties.

## Syntax (C#)
```csharp
public ImportOptions3DM()
```